// const notAllowedCategoriesByBloodType = [
//   {
//     bloodType: '1',
//     categories: ['яйця', 'зернові', 'борошняні вироби', 'молочні вироби'],
//   },
//   {
//     bloodType: '2',
//     categories: ['борошняні вироби', 'молочні вироби', "червоне м'ясо"],
//   },
//   {
//     bloodType: '3',
//     categories: [
//       'зернові',
//       'борошняні вироби',
//       'масла и жири',
//       'горіхи',
//       'овочі та зелень',
//     ],
//   },
//   {
//     bloodType: '4',
//     categories: [
//       'зернові',
//       'борошняні вироби',
//       "червоне м'ясо",
//       'горіхи',
//       'овочі та зелень',
//     ],
//   },
// ];

const notAllowedCategoriesByBloodType = [
  {
    bloodType: '1',
    categories: [
      'безалкогольні напої',
      'масла и жири',
      'копченості',
      'алкогольні напої',
      "червоне м'ясо",
      'ягоди',
      'риба',
      'фрукти',
      'гриби',
      'горіхи',
      'сухофрукти',
      'овочі та зелень',
      'семена',
      'кунжут',
      'мак',
    ],
  },
  {
    bloodType: '2',
    categories: [
      "червоне м'ясо",
      'борошняні вироби',
      'масла и жири',
      'копченості',
      'гриби',
      'яйця',
      'зернові',
      'безалкогольні напої',
      'алкогольні напої',
      'ягоди',
      'риба',
      'фрукти',
      'горіхи',
      'сухофрукти',
      'овочі та зелень',
      'семена',
      'кунжут',
      'мак',
    ],
  },
  {
    bloodType: '3',
    categories: [
      'горіхи',
      'молочні продукти',
      "червоне м'ясо",
      'борошняні вироби',
      'безалкогольні напої',
      'яйця',
      'зернові',
      'масла и жири',
      'копченості',
      'алкогольні напої',
      'ягоди',
      'риба',
      'фрукти',
      'гриби',
      'сухофрукти',
      'овочі та зелень',
      'семена',
      'кунжут',
      'мак',
    ],
  },
  {
    bloodType: '4',
    categories: [
      'яйця',
      'молочні продукти',
      'безалкогольні напої',
      "червоне м'ясо",
      'алкогольні напої',
      'зернові',
      'масла и жири',
      'копченості',
      'борошняні вироби',
      'ягоди',
      'риба',
      'фрукти',
      'гриби',
      'сухофрукти',
      'овочі та зелень',
      'семена',
      'кунжут',
      'мак',
    ],
  },
];

export const getCategoriesByBloodType = bloodType => {
  return notAllowedCategoriesByBloodType.find(
    item => item.bloodType === bloodType
  ).categories;
};
